In [3]:
import pandas as pd
import numpy as np

### Creating a dataframe

In [6]:
df = pd.DataFrame({
    "names":["komal","jatin","ramesh","suresh","manu","ranjan"],
    "age":[23,np.nan,15,43,12,32]
})

In [7]:
df

    names   age
0   komal  23.0
1   jatin   NaN
2  ramesh  15.0
3  suresh  43.0
4    manu  12.0
5  ranjan  32.0

In [8]:
df.describe()

             age
count   5.000000
mean   25.000000
std    12.708265
min    12.000000
25%    15.000000
50%    23.000000
75%    32.000000
max    43.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   6 non-null      object
 1   age     5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 228.0+ bytes

In [15]:
df[df["age"].isna()]

   names  age
1  jatin  NaN

In [17]:
df.head(3)

    names   age
0   komal  23.0
1   jatin   NaN
2  ramesh  15.0

In [18]:
df.tail(3)

    names   age
3  suresh  43.0
4    manu  12.0
5  ranjan  32.0

In [21]:
df.sample(frac = 1)

    names   age
3  suresh  43.0
5  ranjan  32.0
2  ramesh  15.0
0   komal  23.0
4    manu  12.0
1   jatin   NaN

In [26]:
df.sample(n = 2)

    names   age
5  ranjan  32.0
4    manu  12.0

In [24]:
df.nlargest(3,["age"])

    names   age
3  suresh  43.0
5  ranjan  32.0
0   komal  23.0

In [28]:
df.nsmallest(3,["age"])

    names   age
4    manu  12.0
2  ramesh  15.0
0   komal  23.0

In [33]:
df1 = pd.DataFrame({
    "name":["komal","komal","komal","komal","komal","komal"],
    "age":[12,23,12,23,12,23]
})

In [34]:
df1

    name  age
0  komal   12
1  komal   23
2  komal   12
3  komal   23
4  komal   12
5  komal   23

In [36]:
df1.drop_duplicates()

    name  age
0  komal   12
1  komal   23

In [38]:
df1.shape

(6, 2)

In [41]:
list(df1.index)

[0, 1, 2, 3, 4, 5]

In [44]:
list(df.columns)

['names', 'age']

In [45]:
df1.value_counts()

name   age
komal  12     3
       23     3
Name: count, dtype: int64

In [46]:
df.value_counts()

names   age
komal   23.0    1
manu    12.0    1
ramesh  15.0    1
ranjan  32.0    1
suresh  43.0    1
Name: count, dtype: int64

In [49]:
df["names"].value_counts().sum()

6

In [51]:
df["age"].value_counts().sum()

5

In [52]:
df

    names   age
0   komal  23.0
1   jatin   NaN
2  ramesh  15.0
3  suresh  43.0
4    manu  12.0
5  ranjan  32.0

In [57]:
df.dropna(inplace = True)

    names   age
0   komal  23.0
2  ramesh  15.0
3  suresh  43.0
4    manu  12.0
5  ranjan  32.0

In [58]:
pd.melt(df)

  variable   value
0    names   komal
1    names  ramesh
2    names  suresh
3    names    manu
4    names  ranjan
5      age    23.0
6      age    15.0
7      age    43.0
8      age    12.0
9      age    32.0

In [63]:
df.pivot(columns=["names"])

        age
names komal  manu ramesh ranjan suresh
0      23.0   NaN    NaN    NaN    NaN
2       NaN   NaN   15.0    NaN    NaN
3       NaN   NaN    NaN    NaN   43.0
4       NaN  12.0    NaN    NaN    NaN
5       NaN   NaN    NaN   32.0    NaN